In [ ]:
#Importing Libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

print(pd.__version__)

# Load Data
dataset = load_dataset('lukebarousse/data_jobs')

# Convert dataset to pandas DataFrame
df = dataset['train'].to_pandas()

# Change string to datetime ('job_posted_date' column)
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

2.2.3

In [35]:
median_year_salary = df['salary_year_avg'].median()
median_year_salary

115000.0

In [36]:
median_hour_salary = df['salary_hour_avg'].median()
print(f"{median_hour_salary:.2f}")

45.98

In [38]:
df_filled = df
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_year_salary)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_hour_salary)

In [40]:
df_filled.loc[:, 'salary_year_avg':'salary_hour_avg'].head(10)

   salary_year_avg  salary_hour_avg
0         115000.0            45.98
1         115000.0            45.98
2         115000.0            45.98
3         115000.0            45.98
4         115000.0            45.98
5         115000.0            45.98
6         115000.0            45.98
7         115000.0            45.98
8         115000.0            45.98
9         115000.0            45.98

In [41]:
df_unique = df_filled
df_unique = df_unique.drop_duplicates() #drop cols based of all columns

In [42]:
len(df), len(df_filled), len(df_unique)

(785741, 785741, 785640)

In [ ]:
len(df_filled) - len(df_unique)
#dropped 101 duplicate row

101

In [ ]:
df_unique = df_unique.drop_duplicates(subset = ['job_title', 'company_name']) #drop cols based on specific cols

In [ ]:
len(df_filled) - len(df_unique) 
#dropped 277699 duplicate rows

277699